{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "output_dim": 50, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dtype": "float32", "input_dim": 44, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0010000000474974513}, "activation": "relu", "batch_input_shape": [null, 44]}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0010000000474974513}, "activation": "relu", "output_dim": 50}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0010000000474974513}, "activation": "relu", "output_dim": 50}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0010000000474974513}, "activation": "relu", "output_dim": 50}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_5", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0010000000474974513}, "activation": "relu", "output_dim": 50}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_6", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 2}}]}