{"loss": "categorical_crossentropy", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Model", "loss_weights": null, "keras_version": "1.0.6", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 44], "name": "Event Input", "input_dtype": "float32"}, "inbound_nodes": [], "name": "Event Input"}, {"class_name": "Permute", "config": {"trainable": false, "name": "Permutator"}, "inbound_nodes": [[["Event Input", 0, 0]]], "name": "Permutator"}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": false, "init": "glorot_uniform", "bias": true, "activation": "relu", "input_dtype": "float32", "input_dim": 44, "b_regularizer": null, "W_regularizer": null, "output_dim": 20, "batch_input_shape": [null, 44]}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": false, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 20}}], "inbound_nodes": [[["Permutator", 0, 0]]], "name": "Sorted Model"}, {"class_name": "Lambda", "config": {"function": "c\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000\t\u0000\u0000\u0000\u0013 \u0001\u0000sl\u0000\u0000\u0000|\u0000\u0000j\u0000\u0000d\u0001\u0000\u0019t\u0001\u0000\u0088\u0000\u0000\u0083\u0001\u0000\u001a}\u0001\u0000t\u0002\u0000j\u0003\u0000\u0087\u0000\u0000f\u0001\u0000d\u0002\u0000\u0086\u0000\u0000d\u0003\u0000|\u0001\u0000d\u0004\u0000t\u0004\u0000j\u0005\u0000|\u0001\u0000\u0083\u0001\u0000g\u0001\u0000d\u0005\u0000|\u0000\u0000|\u0001\u0000g\u0002\u0000\u0083\u0001\u0003\\\u0002\u0000}\u0002\u0000}\u0003\u0000t\u0004\u0000j\u0006\u0000|\u0002\u0000d\u0006\u0000d\u0007\u0000\u0083\u0001\u0001S(\b\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000c\u0003\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0006\u0000\u0000\u0000\u0013 \u0001\u0000s4\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0001\u0000|\u0000\u0000d\u0000\u0000|\u0002\u0000\u0085\u0003\u0000\u0019d\u0001\u0000|\u0001\u0000j\u0002\u0000d\u0001\u0000\u0019t\u0003\u0000\u0088\u0000\u0000\u0083\u0001\u0000\u0014f\u0002\u0000\u0083\u0002\u0000S(\u0002\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000(\u0004\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0007\u0000\u0000\u0000reshapet\u0005\u0000\u0000\u0000shapet\u0003\u0000\u0000\u0000len(\u0003\u0000\u0000\u0000t\u0001\u0000\u0000\u0000bt\u0001\u0000\u0000\u0000xt\u0004\u0000\u0000\u0000skip(\u0001\u0000\u0000\u0000t\u0005\u0000\u0000\u0000perms(\u0000\u0000\u0000\u0000s\n\u0000\u0000\u0000trainNN.pyt\b\u0000\u0000\u0000<lambda>\u00b3\u0000\u0000\u0000s\u0000\u0000\u0000\u0000t\u0007\u0000\u0000\u0000n_stepst\t\u0000\u0000\u0000sequencest\r\u0000\u0000\u0000non_sequencest\u0006\u0000\u0000\u0000outdimi\u0002\u0000\u0000\u0000(\u0007\u0000\u0000\u0000R\u0002\u0000\u0000\u0000R\u0003\u0000\u0000\u0000t\u0006\u0000\u0000\u0000theanot\u0004\u0000\u0000\u0000scant\u0001\u0000\u0000\u0000Tt\u0006\u0000\u0000\u0000aranget\u0007\u0000\u0000\u0000flatten(\u0004\u0000\u0000\u0000R\u0005\u0000\u0000\u0000R\u0006\u0000\u0000\u0000t\u0003\u0000\u0000\u0000outt\u0001\u0000\u0000\u0000_(\u0001\u0000\u0000\u0000R\u0007\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s\n\u0000\u0000\u0000trainNN.pyt\r\u0000\u0000\u0000clean_outputs\u00b1\u0000\u0000\u0000s\f\u0000\u0000\u0000\u0000\u0001\u0017\u0001\u0015\u0001\u0006\u0001\u0012\u0001\u0015\u0001", "name": "Filter", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": "c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0004\u0000\u0000\u0000\u0013 \u0001\u0000s\"\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019t\u0000\u0000\u0088\u0000\u0000\u0083\u0001\u0000\u001ad\u0002\u0000t\u0000\u0000\u0088\u0000\u0000\u0083\u0001\u0000\u0014f\u0002\u0000S(\u0003\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0014\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0003\u0000\u0000\u0000len(\u0001\u0000\u0000\u0000t\u0001\u0000\u0000\u0000s(\u0001\u0000\u0000\u0000t\u0005\u0000\u0000\u0000perms(\u0000\u0000\u0000\u0000s\n\u0000\u0000\u0000trainNN.pyt\b\u0000\u0000\u0000<lambda>\u00c4\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", "output_shape_type": "lambda"}, "inbound_nodes": [[["Sorted Model", 1, 0]]], "name": "Filter"}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "relu", "input_dtype": "float32", "input_dim": 16800, "b_regularizer": null, "W_regularizer": null, "output_dim": 20, "batch_input_shape": [null, 16800]}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 20}}], "inbound_nodes": [[["Filter", 0, 0]]], "name": "ReLu Network"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "Classifier (Softmax)", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 2}, "inbound_nodes": [[["ReLu Network", 1, 0]]], "name": "Classifier (Softmax)"}], "input_layers": [["Event Input", 0, 0]], "output_layers": [["Classifier (Softmax)", 0, 0]], "name": "model_1"}, "sample_weight_mode": null}